# Pandas

* Series
* DataFrames
* Missing Data
* GroupBy
* Merging, Joining, and Concatenating
* Operations
* Data Input and Output

---
## Series

In [1]:
import numpy as np

In [4]:
import pandas as pd

In [7]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

#### Focus on the data and the index

In [8]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(d) # 사전을 보여줌

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Numpy vs Pandas
* Pandas can hold a variety of objects types

In [16]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [17]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Index

In [18]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [19]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [20]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [21]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [22]:
ser1['USA']

1

In [23]:
ser3=pd.Series(data=labels)

In [25]:
ser3[0]

'a'

In [26]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [27]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

#### Italy와 USSR은 매칭되는 것이 없어 NaN으로 출력됨

---
# DataFrames

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101)

In [30]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
type(df['W'])

pandas.core.series.Series

In [35]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df.W # recommend that you don't use this because it may get confused with various methods.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [37]:
df[]

SyntaxError: invalid syntax (<ipython-input-37-722293926dbc>, line 1)

In [38]:
df[[]]

Empty DataFrame
Columns: []
Index: [A, B, C, D, E]

In [39]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [40]:
type(df[['W','Z']]) # [[ ]] 두 개의 괄호로 불러오면 dataframe

pandas.core.frame.DataFrame

In [47]:
type(df['W']) # [ ] 하나의 괄호로 불러오면 list

pandas.core.series.Series

## Add

In [42]:
df['new'] = df['W']+df['Y']

In [48]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

## Drop

In [44]:
df.drop['new']

TypeError: 'method' object is not subscriptable

In [46]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

아직까지 new가 있음을 발견할 수 있음

# inplace argument

In [51]:
df.drop('new',axis=1,inplace = True)

In [52]:
df # 없어짐

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## axis에서 row가 0이고 column이 1인 이유

In [55]:
df.shape

(5, 4)

## Select Rows in a data frame

* rows

In [58]:
df.loc['C'] # locational labeled based index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [59]:
df.iloc[2] # numerical based index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

## Select a subset of rows and columns

In [60]:
df.loc['B','Y']

-0.84807698340363147

In [61]:
df.loc[['A','B',],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

-----
# Conditional Selection

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [5]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [8]:
booldf=df>0

In [40]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

### Dataframe 형태

In [10]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

False이면 NaN으로 나온다

In [41]:
df[df>0]

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118       NaN       NaN  0.605965     NY
C       NaN  0.740122  0.528813       NaN     WY
D  0.188695       NaN       NaN  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

### Series 형태

In [12]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

Series를 돌려준다.

In [13]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

c행이 False이므로 제거된 결과가 나타났다

#### This is the sort of conditional selection we're going to be using most often throught this course.

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [16]:
resultdf=df[df['W']>0]

In [17]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [18]:
df[df['W']>0]['X'] # Conditional Selection in Pandas 에서 제일 중요한 문장1

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [19]:
df[df['W']>0][['Y','X']] # Conditional Selection in Pandas 에서 제일 중요한 문장2

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [22]:
boolser = df['W']>0
result =df [boolser]
result[['Y','X']] # Conditional Selection in Pandas 에서 제일 중요한 문장3

In [23]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
boolser = df['W']>0
result =df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

# Multiple Conditional Selection

In [28]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Restting index

In [29]:
 df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

Get the index reset to a column and you'll get the actual index then to be numerical
#### 대체 되지 않는다는 점 알아두자. df 쓰면 본래 데이터 df가 나옴

# Set Something Else

In [32]:
newind = 'CA NY WY OR CO'.split( )

In [33]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [34]:
df['States'] = newind

In [35]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [37]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [38]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

---
# Multi-Index

In [10]:
import numpy as np
import pandas as pd

In [12]:
from numpy.random import randn

In [13]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index=list(zip(outside, inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [14]:
list(zip(outside,inside)) # tuple pair로 묶어주는 zip( )

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [15]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [16]:
df

             A         B
G1 1  0.529820  0.823629
   2 -0.582197 -0.215049
   3  0.461573 -0.858562
G2 1 -0.102908 -1.471783
   2 -0.290194  0.706316
   3  0.387370 -0.150500

### Multi-index hierachy

In [17]:
df.loc['G1']

          A         B
1  0.529820  0.823629
2 -0.582197 -0.215049
3  0.461573 -0.858562

In [19]:
df.loc['G1'].loc[1]

A    0.529820
B    0.823629
Name: 1, dtype: float64

#### The basic idea is you can call from outside index continue calling inside deeper

In [20]:
df.index.names

FrozenList([None, None])

In [21]:
df.index.names = ['Groups','Num']

In [22]:
df

                   A         B
Groups Num
G1     1    0.529820  0.823629
       2   -0.582197 -0.215049
       3    0.461573 -0.858562
G2     1   -0.102908 -1.471783
       2   -0.290194  0.706316
       3    0.387370 -0.150500

In [23]:
# G2-B 값을 찾아보자
df.loc['G2'].loc[2]['B']

0.70631592084155748

### Cross Section

In [24]:
df

                   A         B
Groups Num
G1     1    0.529820  0.823629
       2   -0.582197 -0.215049
       3    0.461573 -0.858562
G2     1   -0.102908 -1.471783
       2   -0.290194  0.706316
       3    0.387370 -0.150500

In [25]:
df.loc['G1']

            A         B
Num
1    0.529820  0.823629
2   -0.582197 -0.215049
3    0.461573 -0.858562

In [27]:
df.xs('G1')

            A         B
Num
1    0.529820  0.823629
2   -0.582197 -0.215049
3    0.461573 -0.858562

Cross Section의 좋은 점은 G1-1과 G2-1을 동시에 선택할 수 있다는 점이다.

In [28]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.529820  0.823629
G2     -0.102908 -1.471783

---
# Missing Data

In [29]:
import numpy as np
import pandas as pd

In [30]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [31]:
df=pd.DataFrame(d)

In [32]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Drop NA method

In [33]:
df.dropna()

     A    B  C
0  1.0  5.0  1

null value가 하나라도 포함된 행(row)는 모두 drop한다.

In [34]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

null value가 하나라도 포함된 열(column)는 모두 drop한다.

In [36]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

threshold를 "thresh=n"으로 따라서 row1은 NA value가 하나임으로 남았다.

## Fill NA

In [39]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

일반적으로는 Missing data에는 평균값을 넣는다.

In [38]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [40]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

행을 가져올 때는 loc나 iloc를 사용하고 열을 가져올 때는 dataframe['열이름']을 쓴다

---
# Groupby